import { ResponsiveContainer } from "@/components/common";
import { ProductCard } from "@/components/product/product_card";

export default function ProductPage() {
  const mockData = [
    {
      title: "Автомашины зээл",
      text: "Харилцагч таны хувийн хэрэгцээнд зориулан шинэ болон дугаарттай автомашин худалдан авах зээлийн бүтээгдэхүүний сонлыг болгож байна.",
      path: "Дэлгэрэнгүй",
    },
    {
      title: "Бизнесийн зээл",
      text: "Бизнес эрхлэгч таны бизнесийн үйл ажиллагаанд хөрөнгө оруулалт хийх, тоног төхөөрөмжлөх, эргэлтийн хөрөнгө, үргэлж хэрэгтэй болох үйл ажиллагааны санхүүжилт хэрэгцээг хангахад зориулсан бүтээгдэхүүн.",
      path: "product/business-loan",
    },
    {
      title: "Хэрэглээний зээл",
      text: "Харилцагч таны хувийн болон өрхийн хэрэглээнд зориулсан хэдхэн болон үл хөдлөх хөрөнгө барьцаалсан онцгой боломжтой зээлийн үйлчилгээг сонлыг болгож байна.",
      path: "Дэлгэрэнгүй",
    },
    {
      title: "Шуурхай зээл",
      text: "Харилцагч таны хувийн болон өрхийн хэрэглээнд зориулсан өрхийн хэрэгцээг барьцаалсан авах боломжтой зээлийн үйлчилгээг сонлыг болгож байна.",
      path: "Дэлгэрэнгүй",
    },
    {
      title: "Ногоон зээл",
      text: "Инвескор ББСБ нь байгаль орчин, нийгэмд ээлтэй үр нөлөө бий болгоход зөр нуулсан зээлийн үйлчилгээг тонд сонлыг болгож байна.",
      path: "Дэлгэрэнгүй",
    },
    {
      title: "Кредит карт",
      text: "Голомт банктай хамтарсан Ко-Брэнд Platinum кредит карт нь хувийн болон албаны буюй л хэрэгцээнэ төгс нийцэх хамгийн өндөр зээлийн эрхтэй дээл зөрхийн үйлчилгээг мин хягаадгүйгээр танд хүргэнэ.",
      path: "Дэлгэрэнгүй",
    },
  ];
  return (
    <div className="w-full h-fit flex justify-center pt-[5.21vw] pb-[10.42vw]">
      <ResponsiveContainer>
        <div className="w-full grid grid-cols-3 gap-[1.88vw]">
          {mockData.map((each, index) => (
            <ProductCard key={index} {...each} />
          ))}
        </div>
      </ResponsiveContainer>
    </div>
  );
}
